INSERT INTO day_forecasts (
    date, city
--    , country
    , max_temp, min_temp, avg_temp, condition, daily_chance_of_rain, avg_humidity
) VALUES (
    '2025-09-07', 'Tokyo'
--    , 'Japan'
    , 31.3, 25.9, 28.2, '晴れ', 0.0, 67.0
);

INSERT INTO hour_forecasts (date, time, city
--, country
, temp, condition, chance_of_rain, humidity) VALUES
('2025-09-07','00:00', 'Tokyo', /*'Japan',*/ 26.0, '快晴', night/113 ,0.0, 73.0),
('2025-09-07','01:00', 'Tokyo', /*'Japan',*/ 25.9, '所により曇り', night/113 ,0.0, 74.0),
('2025-09-07','02:00', 'Tokyo', /*'Japan',*/ 25.9, '所により曇り', night/113 ,0.0, 75.0),
('2025-09-07','03:00', 'Tokyo', /*'Japan',*/ 25.9, '所により曇り', night/113 ,0.0, 76.0),
('2025-09-07','04:00', 'Tokyo', /*'Japan',*/ 25.9, '曇り', night/113 ,0.0, 77.0),
('2025-09-07','05:00', 'Tokyo', /*'Japan',*/ 25.9, '所により曇り', night/113 ,0.0, 77.0),
('2025-09-07','06:00', 'Tokyo', /*'Japan',*/ 25.9, '所により曇り', night/113 ,0.0, 76.0),
('2025-09-07','07:00', 'Tokyo', /*'Japan',*/ 26.5, '所により曇り', night/113 ,0.0, 73.0),
('2025-09-07','08:00', 'Tokyo', /*'Japan',*/ 27.4, '所により曇り', night/113 ,0.0, 68.0),
('2025-09-07','09:00', 'Tokyo', /*'Japan',*/ 28.4, '所により曇り', night/113 ,0.0, 63.0),
('2025-09-07','10:00', 'Tokyo', /*'Japan',*/ 29.4, '晴れ', night/113 ,0.0, 59.0),
('2025-09-07','11:00', 'Tokyo', /*'Japan',*/ 30.2, '晴れ', night/113 ,0.0, 56.0),
('2025-09-07','12:00', 'Tokyo', /*'Japan',*/ 30.8, '晴れ', night/113 ,0.0, 55.0),
('2025-09-07','13:00', 'Tokyo', /*'Japan',*/ 31.2, '晴れ', night/113 ,0.0, 54.0),
('2025-09-07','14:00', 'Tokyo', /*'Japan',*/ 31.3, '晴れ', night/113 ,0.0, 54.0),
('2025-09-07','15:00', 'Tokyo', /*'Japan',*/ 31.1, '晴れ', night/113 ,0.0, 55.0),
('2025-09-07','16:00', 'Tokyo', /*'Japan',*/ 30.5, '晴れ', night/113 ,0.0, 58.0),
('2025-09-07','17:00', 'Tokyo', /*'Japan',*/ 31.0, '晴れ', night/113 ,0.0, 63.0),
('2025-09-07','18:00', 'Tokyo', /*'Japan',*/ 28.8, '快晴', night/113 ,0.0, 67.0),
('2025-09-07','19:00', 'Tokyo', /*'Japan',*/ 28.3, '快晴', night/113 ,0.0, 71.0),
('2025-09-07','20:00', 'Tokyo', /*'Japan',*/ 28.2, '快晴', night/113 ,0.0, 72.0),
('2025-09-07','21:00', 'Tokyo', /*'Japan',*/ 28.3, '快晴', night/113 ,0.0, 72.0),
('2025-09-07','22:00', 'Tokyo', /*'Japan',*/ 28.2, '快晴', night/113 ,0.0, 71.0),
('2025-09-07','23:00', 'Tokyo', /*'Japan',*/ 28.0, '快晴', night/113 ,0.0, 72.0);
